logs/2014-11-10_11-04_cassandra_load-c2.out
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p recordcount=10000 -p cassandra.readconsistencylevel=ONE -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=10 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=false -p reconnectionthroughput=10 -p hosts=54.171.209.23,54.171.213.53,54.171.105.34 -p operationcount=1666 -p maxexecutiontime=2400 -p cassandra.writeconsistencylevel=ONE -p measurementtype=timeseries -p reconnectiontime=1000 -p fieldlength=10 -p insertstart=1666 -p insertcount=1666 -load
 0 sec: 0 operations; 
 2 sec: 0 operations; 
 4 sec: 0 operations; 
 6 sec: 0 operations; 
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Connected to cluster: datalabs-cassandra
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Connected to cluster: datalabs-cassandra
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.106; Rack: 1b
Datacenter: eu-west; Host: /54.171.105.34; Rack: 1b
Datacenter: eu-west; Host: /172.31.27.105; Rack: 1b
 8 sec: 0 operations; 
created keyspace ycsb
created keyspace ycsb
created keyspace ycsb
[...]
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
created keyspace ycsb
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 10 sec: 0 operations; 
created keyspace ycsb
created keyspace ycsb
created keyspace ycsb
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 12 sec: 0 operations; 
 14 sec: 0 operations; 
 16 sec: 0 operations; 
 18 sec: 0 operations; 
 20 sec: 228 operations; 114 current ops/sec;  
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
Executed create table if not exists ycsb.usertable (
     y_id varchar primary key,
      field0 blob,
      field1 blob,
      field2 blob,
      field3 blob,
      field4 blob,
      field5 blob,
      field6 blob,
      field7 blob,
      field8 blob,
      field9 blob);
 22 sec: 472 operations; 121.94 current ops/sec;  
 24 sec: 917 operations; 222.5 current ops/sec;   
 25 sec: 1162 operations; 215.86 current ops/sec;   
[INSERT], 0, 6969.8, 200.0
[INSERT], 100, 21615.1, 100.0
[INSERT], 200, 15593.117647058823, 340.0
[INSERT], 300, 8600.451612903225, 310.0
[INSERT], 400, 32024.53846153846, 130.0
[INSERT], 500, 17230.4, 150.0
[INSERT], 600, 19488.852941176472, 340.0
[INSERT], 700, 63087.857142857145, 70.0
[INSERT], 800, 19408.4, 200.0
[INSERT], 900, 15143.56, 250.0
[INSERT], 1000, 12167.947368421053, 190.0
[INSERT], 1100, 62210.22222222222, 90.0
[INSERT], 1200, 16794.26923076923, 260.0
[INSERT], 1300, 13903.777777777777, 270.0
[INSERT], 1400, 8903.0, 20.0
[INSERT], 1500, 63212.22222222222, 90.0
[INSERT], 1600, 129977.66666666667, 30.0
[INSERT], 1700, 26859.9, 200.0
[INSERT], 1800, 20292.285714285714, 140.0
[INSERT], 1900, 39245.75, 40.0
[INSERT], 2100, 94586.0, 120.0
[INSERT], 2300, 180821.4, 50.0
[INSERT], 2400, 15845.5, 220.0
[INSERT], 2500, 10305.26923076923, 260.0
[INSERT], 2600, 46297.57142857143, 70.0
[INSERT], 2700, 28347.545454545456, 110.0
[INSERT], 2800, 41465.38461538462, 130.0
[INSERT], 2900, 38542.5, 160.0
[INSERT], 3000, 22773.555555555555, 180.0
[INSERT], 3100, 18876.95238095238, 210.0
[INSERT], 3200, 24848.23076923077, 130.0
[INSERT], 3300, 17221.0, 110.0
[INSERT], 3500, 32376.225806451614, 310.0
[INSERT], 3600, 32659.666666666668, 120.0
[INSERT], 3700, 21439.333333333332, 180.0
[INSERT], 3800, 21088.941176470587, 170.0
[INSERT], 3900, 32223.444444444445, 90.0
[INSERT], 4000, 16801.18181818182, 110.0
[INSERT], 4100, 48422.2, 50.0
[INSERT], 4200, 7668.117647058823, 170.0
[INSERT], 4300, 6826.0, 100.0
[INSERT], 4400, 9412.775510204081, 490.0
[INSERT], 4500, 6137.158730158731, 630.0
[INSERT], 4600, 8407.951219512195, 410.0
[INSERT], 4700, 7125.555555555556, 450.0
[INSERT], 4800, 11133.722222222223, 180.0
[INSERT], 4900, 4980.129032258064, 310.0
[INSERT], 5000, 24980.590909090908, 220.0
[INSERT], 5100, 7300.952380952381, 420.0
[INSERT], 5200, 4766.2307692307695, 260.0
[INSERT], 5300, 14559.153846153846, 260.0
[INSERT], 5400, 3046.470588235294, 170.0
[INSERT], 5500, 45990.63636363636, 110.0
[INSERT], 5600, 23856.944444444445, 180.0
[INSERT], 5700, 6073.548387096775, 310.0
[INSERT], 5800, 19236.0, 30.0
[INSERT], 5900, 17560.17391304348, 230.0
[INSERT], 6000, 3824.151515151515, 330.0
[INSERT], 6100, 13426.857142857143, 70.0
[CLEANUP], 0, 1.0, 10.0
[CLEANUP], 100, 0.0, 10.0
[CLEANUP], 400, 0.0, 10.0
[CLEANUP], 800, 0.0, 10.0
[CLEANUP], 1900, 0.0, 10.0
[CLEANUP], 2100, 0.0, 10.0
[INSERT], 6200, 4747.666666666667, 90.0
[INSERT], Operations, 1162
[INSERT], Retries, 0
[INSERT], AverageLatency(us), 18248.210843373494
[INSERT], MinLatency(us), 1479
[INSERT], MaxLatency(us), 342257
[INSERT], Return=0, 1162
[CLEANUP], 2400, 0.0, 10.0
[CLEANUP], Operations, 7
[CLEANUP], Retries, 0
[CLEANUP], AverageLatency(us), 0.14285714285714285
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[OVERALL], Reconnections, 0.0
[OVERALL], RunTime(ms), 4539.0
[OVERALL], Operations, 1162.0
[OVERALL], Throughput(ops/sec), 256.0035250055078
java -cp /home/ubuntu/ycsb/guava-17.0.jar:/opt/ycsb/core/lib/core-0.1.4.jar:/opt/ycsb/cassandra-binding/lib/cassandra-binding-0.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p recordcount=10000 -p cassandra.readconsistencylevel=ONE -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=10 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=false -p reconnectionthroughput=10 -p hosts=54.171.209.23,54.171.213.53,54.171.105.34 -p operationcount=1666 -p maxexecutiontime=2400 -p cassandra.writeconsistencylevel=ONE -p measurementtype=timeseries -p reconnectiontime=1000 -p fieldlength=10 -p insertstart=1666 -p insertcount=1666 -load